transaction-manager/transaction-manager-component-test/src/test/resources/data/response/cardauth/cain002ResponseForMagStripe.json

{
  "cardAuthStatus": "SUCCESS",
  "cain002Response": {
    "header": {
      "type": "CARD_AUTH",
      "url": null
    },
    "messages": [
      {
        "type": "CAIN002",
        "message": {
          "TRANSACTION_DATE": "2019-08-23T23:00:00.000+0000",
          "MERCHANT_CATEGORY_CODE": "6010",
          "CARD_PROCESSOR_ACCOUNT_ID": "12380",
          "CARD_ACCEPTOR_POST_CODE": "HA1 2TU",
          "INITIATOR_PARTY_ID": null,
          "TRANSACTION_TYPE": "CRDP",
          "CARDHOLDER_PRESENT": "true",
          "CARD_ACCEPTOR_CITY": "London",
          "TRANSACTION_RESPONSE_CODE": "DECL",
          "TRANSACTION_AMOUNT_QUALIFIER": "ACTL",
          "AMOUNT": 1,
          "CARD_ACCEPTOR_NAME": "TESCO",
          "CARD_DATA_ENTRY_MODE": "CICC",
          "CARD_ACCEPTOR_COUNTRY_CODE": "GBR",
          "TRANSACTION_CURRENCY_CODE": "GBP",
          "TOTAL_AMOUNT": "1",
          "BANKNET_REFERENCE_NUMBER": "MNW794480"
        },
        "additionalInfo": {
          "SUBSCRIPTION_KEY": "3df2c7d7-b8d4-42d9-a599-c40abd8824b6",
          "PARTY_KEY": "abb03427-7889-4a41-a477-f48201f0a392",
          "PRODUCT_KEY": "ac6d4ed5-3f58-4d11-bdc1-5bfdd42e9c7a",
          "SUBSCRIPTION_STATUS": "ACTIVE",
          "DEBIT_CREDIT_INDICATOR": "DEBIT",
          "PAYMENT_METHOD_TYPE": "POS_MAG_STRIPE",
          "CARD_PROCESSOR_ACCOUNT_ID": "12380",
          "TRANSACTION_ID": "014b0939db-d0da-43fe-9c51-cf825c3ec7a91569593721132",
          "TRANSACTION_CODE": "PMNT.MGST.CWDL"
        }
      }
    ],
    "additionalInfo": {
      "TRANSACTION_CORRELATION_ID": "5410319651",
      "POSTED_BALANCE": 100,
      "l5d-test": "test123",
      "x-b3-traceid": "5c41b539181035048daf8df39b94f2fd",
      "TENANT_PARTY_KEY": "10000",
      "TRANSACTION_STATUS": "SUCCESS"
    }
  }
}